# FilterableValueProvider Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterableValueProvider Properties
FilterableValueProvider Class See Also
---
The FilterableValueProvider type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FilterableValueProvider Class
Autodesk.Revit.DB Namespace